<?php
$list = $_REQUEST['list'];
//$list = 'sh600837,sh600006,';
$url = 'http://hq.sinajs.cn/list='.$list;
$content = iconv('GB2312','UTF-8//IGNORE',file_get_contents($url));
//echo $content;
/*
$content = 'var hq_str_sh600837="海通证券,23.80,23.88,24.06,24.99,23.28,24.06,24.08,613444051,14868814580,86500,24.06,371399,24.05,146590,24.04,148200,24.03,329400,24.02,817084,24.08,169955,24.09,622800,24.10,46900,24.11,183900,24.12,2014-12-31,15:03:06,00";
var hq_str_sh600006="东风汽车,5.85,5.85,5.95,5.99,5.81,5.94,5.95,26037115,153675064,73200,5.94,45100,5.93,93200,5.92,155300,5.91,164191,5.90,257880,5.95,176400,5.96,138100,5.97,348800,5.98,619600,5.99,2014-12-31,15:03:06,00";';
0:'股票名字',
1:'今日开盘价',
2:'昨日收盘价',
3:”当前价格',
4:”今日最高价',
5:”今日最低价',
6:”竞买价',
7:”竞卖价',
8:”成交的股票数',
9:”成交金额',
10:”买一gs”,
11:”买一bj",
12:”买二gs”,
13:”买二bj”,
14:”买三gs”,
15:”买三bj”,
16:”买四gs”,
17:”买四bj”,
18:”买五gs”,
19:”买五bj”,
20:”卖一gs”,
21:”卖一bj”,
22:'m2gs',
23:’m2bj',
24:'m3gs',
25:'m3bj',
26:'m4gs',
27:'m4bj',
28:'m5gs',
29:'m5bj',
30:'日期',
31:'时间',
 */
$lines = explode("\n",$content);
$rows = array();
foreach($lines as $l){
    $l = trim($l);
    $arr = explode('"',$l);
    $zqdm = substr($arr[0],-7,6);
    //echo $zqdm."\n";
    $bl = $arr[1];
    $row = explode(',',$bl);
    $row['zqdm'] = $zqdm;
    if($row[2] > 0)
        $rows[] = $row;
}
echo json_encode($rows,JSON_UNESCAPED_UNICODE);
