<?php
return  array(
    'jgd' =>array(
        'name'=>'交割单'
        ,'filename'=>'jgd.csv' //文件名
        ,'idfs'=>array(0,2,4,5,6,7,8,9,10,11,12,13,16) // 哪些字段参与id计算 note!!! 修改后所有的需要重新计算
        ,'aheader'=>array(
            'comment'=>'原因记录'
        )
        ,'groups'=>array(
            0 => '交割日期',
            2 => '证券代码',
            3 => '证券名称',
            17 => '股东代码',
            18 => '资金帐号',
        )
        ,'header'=> array(
            0 => '交割日期',
            1 => '业务名称',
            2 => '证券代码',
            3 => '证券名称',
            4 => '成交价格',
            5 => '成交数量',
            6 => '剩余数量',
            7 => '成交金额',
            8 => '清算金额',
            9 => '剩余金额',
            10 => '佣金',
            11 => '印花税',
            12 => '过户费',
            13 => '结算费',
            14 => '附加费',
            15 => '币种',
            16 => '成交编号',
            17 => '股东代码',
            18 => '资金帐号',
        )
    )
    ,'lscj' =>array(
        'name'=>'历史成交'
        ,'filename'=>'cjjl.csv' //文件名
        ,'idfs'=>array(0,1,2,5,6,7,8,9,12,15) // 哪些字段参与id计算 note!!! 修改后所有的需要重新计算
        ,'groups'=>array(
            2 => '证券代码',
        )
        ,'header'=>array (
            0 => '成交日期',
            1 => '成交时间',
            2 => '证券代码',
            3 => '证券名称',
            4 => '买卖标志',
            5 => '委托价格',
            6 => '委托数量',
            7 => '委托编号',
            8 => '成交价格',
            9 => '成交数量',
            10 => '成交金额',
            11 => '成交编号',
            12 => '股东代码',
            13 => '交易所名称',
            14 => '备注',
            15 => '剩余数量',
        )
        ,'aheader'=>array(
            'comment'=>'思路原因'
        )

    )
    ,'zjls' =>array(
        'name'=>'资金流水'
        ,'filename'=>'zjls.csv' //文件名
        ,'idfs'=>array(0,2,3,5,6,9,10,11)//数据库中头的id
        ,'groups'=>array(
            9 => '证券代码',
        )
        ,'header'=>array (
            0 => '成交日期',
            1 => '业务名称',
            2 => '发生金额',
            3 => '剩余金额',
            4 => '证券名称',
            5 => '成交价格',
            6 => '成交数量',
            7 => '剩余数量',
            8 => '币种',
            9 => '证券代码',
            10 => '股东代码',
            11 => '资金帐号',
        )
    ),
);
